backend/app/views/photos/index.html.erb

					<td><%= photo.name%></td>
					<td><%= PhotoCategory.find(photo.photo_category_id).name%></td>
---
SELECT `photo_categories`.* FROM `photo_categories` WHERE `photo_categories`.`id` = 16 LIMIT 1