backend/app/controllers/categories_controller.rb

INSERT INTO `categories` (`created_at`, `name`, `title`, `updated_at`) VALUES ('2013-11-11 21:21:38', 'goodfriends', '好朋友', '2013-11-11 21:21:38')
---
  def create
     Category.create(params[:category])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1
---
  def edit
    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 11 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 11
---
  def delete
    category = Category.find(params[:id])
    category.destroy