backend/app/controllers/essays_controller.rb

  def index
    @essays = Essay.all
---
SELECT `essays`.* FROM `essays`

  def edit
    @essay = Essay.find(params[:id])
---
SELECT `essays`.* FROM `essays` WHERE `essays`.`id` = 9 LIMIT 1

  def delete
    essay = Essay.find(params[:id])
    essay.destroy
---
SELECT `essays`.* FROM `essays` WHERE `essays`.`id` = 10 LIMIT 1
DELETE FROM `essays` WHERE `essays`.`id` = 10

  def update
    @essay = Essay.find(params[:id])
    @essay.update_attributes(params[:essay])
---
SELECT `essays`.* FROM `essays` WHERE `essays`.`id` = 9 LIMIT 1
UPDATE `essays` SET `title` = '谁以微笑 淡抹了年华', `author` = '萍踪浪迹', `updated_at` = '2013-11-14 15:27:21' WHERE `essays`.`id` = 9