backend/app/controllers/focus_controller.rb

	def index
		@focus = Focus.order("created_at").limit(16)
---
SELECT `focus`.* FROM `focus` ORDER BY created_at LIMIT 16

	def delete
		focus = Focus.find(params[:id])
		origin_file = "/home/server/caishu/static/uploaders/origin/#{focus.photo_category_id}/#{focus.alias_name}"
		File.delete(origin_file) if File.exist?(origin_file)

		avatar_file = "/home/server/caishu/static/uploaders/avatar/#{focus.photo_category_id}/#{focus.alias_name}"
    File.delete(avatar_file) if File.exist?(avatar_file)

    focus_file = "/home/server/caishu/static/uploaders/focus/#{focus.photo_category_id}/#{focus.alias_name}"
		File.delete(focus_file) if File.exist?(focus_file)
---
SELECT `focus`.* FROM `focus` WHERE `focus`.`id` = 6 LIMIT 1
DELETE FROM `focus` WHERE `focus`.`id` = 6

	def new
		photo_category = PhotoCategory.all
---
SELECT `categories`.* FROM `categories`
SELECT `photo_categories`.* FROM `photo_categories`

	def create
		name = params[:focus][:name]
		photo_category_id = params[:focus][:photo_category_id]
		file = params[:focus][:file]
		head_name = file.original_filename.split(".")[0]
		suffix = file.original_filename.split(".")[1]
		alias_name = Digest::SHA1.hexdigest(head_name)+"."+ suffix
		url = File.join(Settings.origin_url, photo_category_id.to_s, alias_name)
		path = File.join(Settings.origin_directory, photo_category_id.to_s, alias_name)
		File.open(path, "wb") { |f| f.write(file.read) }

		connection = Bunny.new('amqp://guest:guest@127.0.0.1:5672')
		connection.start
		connection.queue('resize_focus_photos',durable: true)
		exchange = connection.exchange('',durable: true)

		content = alias_name + "|" + photo_category_id
		exchange.publish(content,:key => 'resize_focus_photos',:content_type => 'text/plain')
		connection.stop

		Focus.create(name: name, photo_category_id: photo_category_id, alias_name: alias_name, url: url)
---
INSERT INTO `focus` (`alias_name`, `channel`, `created_at`, `name`, `photo_category_id`, `updated_at`, `url`) VALUES ('8479db7b339da751f6b87a1d31dd9050ee9939a2.jpg', NULL, '2013-11-14 22:19:35', 'dm', 8, '2013-11-14 22:19:35', 'http://static.menghuanwd.cn/uploaders/origin/8/8479db7b339da751f6b87a1d31dd9050ee9939a2.jpg')