backend/app/controllers/goodfriends_controller.rb

	def index
		@goodfriends = Goodfriend.order("created_at desc")
---
SELECT `goodfriends`.* FROM `goodfriends` ORDER BY created_at desc

			connection.stop
		end

		Goodfriend.create(
			qq: qq,
			qq_name: qq_name,
			weixin: weixin,
			weixin_name: weixin_name,
			gender: gender,
			age: age,
			truth_name: truth_name,
			weixin_name: weixin_name,
			qq: qq,
			photo: url || "",
			telephone: telephone
		)
---
INSERT INTO `goodfriends` (`age`, `created_at`, `gender`, `photo`, `qq`, `qq_name`, `telephone`, `truth_name`, `updated_at`, `weixin`, `weixin_name`) VALUES (24, '2013-11-11 21:24:08', 0, '稍等', '651019063', '路上不回头', '15201991024', '顾益峰', '2013-11-11 21:24:08', 'menghuanwd', '路上不回头')

	def edit
		@goodfriend = Goodfriend.find(params[:id])
---
SELECT `goodfriends`.* FROM `goodfriends` WHERE `goodfriends`.`id` = 11 LIMIT 1

	def delete
		goodfriend = Goodfriend.find(params[:id])
		gp = goodfriend.photo.split("weixin")[1]
		origin_file = "/home/server/caishu/static/uploaders/weixin/#{gp}"
		File.delete(origin_file) if File.exist?(origin_file)

		goodfriend.destroy
---
SELECT `goodfriends`.* FROM `goodfriends` WHERE `goodfriends`.`id` = 1 LIMIT 1
DELETE FROM `goodfriends` WHERE `goodfriends`.`id` = 1

	def update
		@goodfriend = Goodfriend.find(params[:id])
---
SELECT `goodfriends`.* FROM `goodfriends` WHERE `goodfriends`.`id` = 13 LIMIT 1