backend/app/controllers/jokes_controller.rb

	def index
		@size= Joke.all.size
		@jokes = Joke.order("id desc").page(params[:page]).per(50)
---
SELECT COUNT(*) FROM `jokes`
SELECT `jokes`.* FROM `jokes`
SELECT `jokes`.* FROM `jokes` ORDER BY id desc LIMIT 50 OFFSET 0