backend/app/controllers/moods_controller.rb

SELECT `moods`.* FROM `moods` ORDER BY created_at desc
---
	def index
		@moods = Mood.order("created_at desc")

INSERT INTO `moods` (`content`, `created_at`, `mood_category_id`, `photo_mood_id`, `title`, `updated_at`) VALUES ('打了一天的酱油，真是的， 早上开机电脑就死，重启一下，启不动了，让网管就修修，修到下午4点，又真是的，然后我开始装软件，装驱动，装环境，还有一大堆的账号密码等着我去输入，又一个7点20了，在弄下准备回家，头疼。', '2013-11-11 19:20:58', NULL, NULL, '今天重装电脑', '2013-11-11 19:20:58')
---
	def create

    Mood.create(params[:mood])

SELECT `moods`.* FROM `moods` WHERE `moods`.`id` = 3 LIMIT 1
---
  def edit
    @mood = Mood.find(params[:id])

SELECT `moods`.* FROM `moods` WHERE `moods`.`id` = 9 LIMIT 1
DELETE FROM `moods` WHERE `moods`.`id` = 9
---
  def delete
    mood = Mood.find(params[:id])
    mood.destroy