backend/app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT `notes`.* FROM `notes`

  def new
    note_category = NoteCategory.all
---
SELECT `note_categories`.* FROM `note_categories`

  def create
    Note.create(params[:note])
---
INSERT INTO `notes` (`content`, `created_at`, `note_category_id`, `title`, `updated_at`) VALUES ('<p>17 * &nbsp; &nbsp;* * * &nbsp; root &nbsp; &nbsp;cd / &amp;&amp; run-parts --report /etc/cron.hourly&nbsp;<br />\r\n25 6 &nbsp; &nbsp;* * * &nbsp; root &nbsp; &nbsp;test -x /usr/sbin/anacron || ( cd / &amp;&amp; run-parts --report /etc/cron.daily )&nbsp;<br />\r\n47 6 &nbsp; &nbsp;* * 7 &nbsp; root &nbsp; &nbsp;test -x /usr/sbin/anacron || ( cd / &amp;&amp; run-parts --report /etc/cron.weekly )&nbsp;<br />\r\n52 6 &nbsp; &nbsp;1 * * &nbsp; root &nbsp; &nbsp;test -x /usr/sbin/anacron || ( cd / &amp;&amp; run-parts --report /etc/cron.monthly )<br />\r\n0 &nbsp;3 &nbsp; &nbsp;* * * &nbsp; root &nbsp; &nbsp;/bin/sync<br />\r\n0 &nbsp;3 &nbsp; &nbsp;* * * &nbsp; root &nbsp; &nbsp;/bin/echo &quot;1&quot; &gt; /proc/sys/vm/drop_caches<br />\r\n1 &nbsp;* &nbsp; &nbsp;* * * &nbsp; root &nbsp; &nbsp;ntp ntpdate.sjtu.edu.cn &nbsp; &nbsp; &nbsp; &nbsp;(此行是用来同步时间的)</p>\r\n\r\n<p>Ubuntu调用run-parts命令，定时运行四个目录下的所有脚本。<br />\r\n/etc/cron.hourly下的脚本会被每小时运行一次，在每小时的17分时运行。<br />\r\n/etc/cron.daily下的脚本会被每天运行一次，在每天6点25分运行。<br />\r\n/etc/cron.weekly下的脚本会被每周运行一次，在每周第7天的6点47分运行。<br />\r\n/etc/cron.monthly下的脚本会被每月运行一次，在每月1号的6点52分运行。</p>\r\n\r\n<p>ubuntu下启动、停止与重启cron<br />\r\nsudo /etc/init.d/cron start<br />\r\nsudo /etc/init.d/cron stop<br />\r\nsudo /etc/init.d/cron restart</p>\r\n', '2013-11-08 16:46:29', 3, 'cron 定时任务', '2013-11-08 16:46:29')

  def edit
    note_category = NoteCategory.all
    @note_categories = []

    note_category.each do |note_category|
      arr_tmp = []
      arr_tmp << note_category.name << note_category.id
      @note_categories << arr_tmp
    end

    @note = Note.find(params[:id])
---
SELECT `note_categories`.* FROM `note_categories`
SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 26 LIMIT 1

  def update
    @note = Note.find(params[:id])
    @note.update_attributes(params[:note])
---
SELECT `notes`.* FROM `notes` WHERE `notes`.`id` = 26 LIMIT 1
UPDATE `notes` SET `content` = '<div style=\"color: rgb(0, 0, 0); font-family: 微软雅黑; font-size: 14px; line-height: normal; orphans: 2; text-align: -webkit-auto; widows: 2;\">\r\n<p>curl http://www.linuxidc.com</p>\r\n\r\n<p>curl -o page.html http://www.linuxidc.com</p>\r\n\r\n<p>curl -o 1.jpg http://a.hiphotos.baidu.com/album/w%3D230/sign=1.jpg</p>\r\n\r\n<p>curl -O http://a.hiphotos.baidu.com/album/w%3D230/sign=2.jpg</p>\r\n\r\n<p>curl -O http://cgi2.tky.3web.ne.jp/~zzh/screen[1-10].JPG</p>\r\n</div>\r\n', `updated_at` = '2013-11-13 11:54:25' WHERE `notes`.`id` = 26