backend/app/controllers/note_categories_controller.rb

SELECT `note_categories`.* FROM `note_categories`
---
  def index
    @note_categories = NoteCategory.all