backend/app/controllers/philosophies_controller.rb

SELECT `philosophies`.* FROM `philosophies`
---
  def index
    @philosophies = Philosophy.all

INSERT INTO `philosophies` (`content`, `created_at`, `title`, `updated_at`) VALUES ('舌尖上的中国，手心上的美国，车轮上的德国，脚尖上的巴西，硬盘上的日本', '2013-11-08 17:24:10', NULL, '2013-11-08 17:24:10')
---
  def create
    Philosophy.create(params[:philosophy])

SELECT `philosophies`.* FROM `philosophies` WHERE `philosophies`.`id` = 13 LIMIT 1
---
  def edit
    @philosophy = Philosophy.find(params[:id])

SELECT `philosophies`.* FROM `philosophies` WHERE `philosophies`.`id` = 13 LIMIT 1
UPDATE `philosophies` SET `content` = '舌尖上的中国，手心上的美国，车轮上的德国，脚尖上的巴西，硬盘上的日本。', `updated_at` = '2013-11-08 17:24:18' WHERE `philosophies`.`id` = 13
---
  def update
    @philosophy = Philosophy.find(params[:id])
    @philosophy.update_attributes(params[:philosophy])