backend/app/controllers/photo_categories_controller.rb

  def index
    @photo_categories = PhotoCategory.all
---
SELECT `categories`.* FROM `categories`
SELECT `photo_categories`.* FROM `photo_categories`

  def create
    photo_category = PhotoCategory.create(params[:photo_category])
---
INSERT INTO `photo_categories` (`created_at`, `name`, `updated_at`) VALUES ('2013-11-15 08:01:39', '高圆圆', '2013-11-15 08:01:39')

  def delete
    photo_category = PhotoCategory.find(params[:id])

    mutiphotos_uploader_file = "/home/server/caishu/mutiphotos_uploader/#{photo_category.id}"
    Dir.rmdir(mutiphotos_uploader_file) if File.exist?(mutiphotos_uploader_file)

    avatar_file = "/home/server/caishu/static/uploaders/avatar/#{photo_category.id}"
    Dir.rmdir(avatar_file) if File.exist?(avatar_file)

    origin_file = "/home/server/caishu/static/uploaders/origin/#{photo_category.id}"
    Dir.rmdir(origin_file) if File.exist?(origin_file)

    web_file = "/home/server/caishu/static/uploaders/web/#{photo_category.id}"
    Dir.rmdir(web_file) if File.exist?(web_file)

    photo_category.destroy
---
SELECT `photo_categories`.* FROM `photo_categories` WHERE `photo_categories`.`id` = 11 LIMIT 1
DELETE FROM `photo_categories` WHERE `photo_categories`.`id` = 11