backend/app/controllers/photos_controller.rb

	def index
		name = params[:name]
		photo_category_id =  params[:photo_category_id]

		condition_strs = []
		condition_hash = {}

		if name && !name.empty?
			condition_strs << "name like :name"
			condition_hash[:name] = "%#{name}%"
		end

		if photo_category_id && !photo_category_id.empty? && photo_category_id != "0"
			condition_strs << "photo_category_id = :photo_category_id"
			condition_hash[:photo_category_id] = photo_category_id
		end
		@page = params[:page]
		@photos = Photo.where(condition_strs.join(" and "),condition_hash).order("created_at desc").page(params[:page]).per(15)
		photo_category = PhotoCategory.all
---
SELECT COUNT(*) FROM `photos` WHERE (photo_category_id = '11')
SELECT `photos`.* FROM `photos` WHERE (photo_category_id = '11') ORDER BY created_at desc LIMIT 15 OFFSET 0
SELECT `categories`.* FROM `categories`
SELECT `photo_categories`.* FROM `photo_categories`

	def delete
		photo = Photo.find(params[:id])

		origin_file = "/home/server/caishu/static/uploaders/origin/#{photo.photo_category_id}/#{photo.alias_name}"
		File.delete(origin_file) if File.exist?(origin_file)

		avatar_file = "/home/server/caishu/static/uploaders/avatar/#{photo.photo_category_id}/#{photo.alias_name}"
    File.delete(avatar_file) if File.exist?(avatar_file)

    web_file = "/home/server/caishu/static/uploaders/web/#{photo.photo_category_id}/#{photo.alias_name}"
    File.delete(web_file) if File.exist?(web_file)

		photo.destroy
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 6766 LIMIT 1
DELETE FROM `photos` WHERE `photos`.`id` = 6766