backend/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'redis' AND `users`.`password` = 'redis' LIMIT 1
---
  def create
    username = params[:user][:username]
    password = params[:user][:password]
    user = User.where(:username => username, :password => password).first