backend/app/views/layouts/_header.html.erb

      <ul class="nav navbar-nav">
        <% Category.all.each do |category|%>
---
SELECT `categories`.* FROM `categories`